MobScanner/src/Catalogs/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Settings</name>
  <predefined>
    <items>
      <name>PlayTextMessages</name>
      <description>Play text messages</description>
    </items>
    <items>
      <name>SoundWhenScanningBarcode</name>
      <description>Sound when scanning barcode</description>
    </items>
    <items>
      <name>UseVoiceInputOfProductDescriptions</name>
      <description>Use voice input of product descriptions</description>
    </items>
    <items>
      <name>VibrationWhenScanningBarcode</name>
      <description>Vibration when scanning barcode</description>
    </items>
  </predefined>
  <attributes>
    <name>Value</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

MobScanner/src/CommonModules/MainModule/Module.bsl
Function Sound() Export 
	
	Return Catalogs.Settings.SoundWhenScanningBarcode.Value
	
EndFunction

Function Vibration() Export 
	
	Return Catalogs.Settings.VibrationWhenScanningBarcode.Value;
	
EndFunction

Function UseVoiceInputOfProductDescriptions() Export 
	
	Return Catalogs.Settings.UseVoiceInputOfProductDescriptions.Value;
	
EndFunction

Function PlayTextMessages() Export 
	
	Return Catalogs.Settings.PlayTextMessages.Value;
	
EndFunction

Function TokenDropBox() Export 
	
	Return Constants.TokenDropBox.Get();
	
EndFunction
